/** 
    DSE 課程學位狀態 v1.1
    
    作者: j113203 (Wong Ka Wa)
    建立時間: 2017-07-11
    
    未經授權 , 不得轉載
*/

$("#grid").html("<h1>Power By j113203</h1>");

/*DATA MODAL*/
var kendoMODAL = function(程度, 學校, 課程, 剩餘學額) {
    this.程度 = 程度;
    this.學校 = 學校;
    this.課程 = 課程;
    this.剩餘學額 = 剩餘學額;
    kendoDATA.push({
        程度: 程度,
        學校: 學校,
        課程: 課程,
        剩餘學額: 剩餘學額
    });
};

var hkuspace = function(cc, Programme, open, KEC, HPSHCC) {
    this.cc = cc;
    this.Programme = Programme;
    this.open = open;
    this.KEC = KEC;
    this.HPSHCC = HPSHCC;
};

var hkbu = function(Programme, open) {
    this.Programme = Programme;
    this.open = open;
};

/*CORE*/
var kendoDATA = [];
var hkuspaceRESULT = [];
var hkbuRESULT = [];

var hkuspaceHandle = function(temp) {

    var tr = temp.getElementsByTagName("tr");

    var 程度 = 0;

    for (var i = 0; i < tr.length; i++) {
        var e = tr[i];
        if (e.children.length == 9) {
            var item = new hkuspace(
                e.children[0].textContent.trim(),
                e.children[1].textContent.trim(),
                e.children[2].textContent.trim(),
                e.children[3].innerHTML.includes("TICK") || e.children[5].innerHTML.includes("TICK") || e.children[7].innerHTML.includes("TICK"),
                e.children[4].innerHTML.includes("TICK") || e.children[6].innerHTML.includes("TICK") || e.children[8].innerHTML.includes("TICK")
            );

            if (item.KEC) {
                new kendoMODAL(["Diploma in Foundation Studies Programme 基礎專上教育文憑課程", "Associate Degree Programmes 副學士課程", "Higher Diploma Programmes 高級文憑課程"][{
                        3: 0,
                        7: 1,
                        11: 2
                    }[程度]],
                    "HKU SPACE Community College Kowloon East Campus 港大附屬學院九龍東分校",
                    item.Programme,
                    item.open
                );
            }

            if (item.HPSHCC) {
                new kendoMODAL(["Diploma in Foundation Studies Programme 基礎專上教育文憑課程", "Associate Degree Programmes 副學士課程", "Higher Diploma Programmes 高級文憑課程"][{
                        3: 0,
                        7: 1,
                        11: 2
                    }[程度]],
                    "HKU SPACE Po Leung Kuk Stanley Ho Community College  港大保良何鴻燊社區書院",
                    item.Programme,
                    item.open
                );
            }


            hkuspaceRESULT.push(item);


        } else {
            程度++;
        }
    }
};

var hkbuHandle = function(temp) {
    var tr = temp.getElementsByTagName("tr");

    for (var i = 0; i < tr.length; i++) {
        var e = tr[i];
        if (e.children.length == 3) {
            var item = new hkbu(
                e.children[1].textContent.trim(),
                e.children[2].innerHTML.includes("tick") ? "Yes 是" : "No 否"
            );

            new kendoMODAL("Associate Degree Programmes 副學士課程",
                "香港浸會大學國際學院(九龍塘校園)",
                item.Programme,
                item.open
            );

            new kendoMODAL("Associate Degree Programmes 副學士課程",
                "香港浸會大學國際學院 (石門校園)",
                item.Programme,
                item.open
            );
        }
        hkbuRESULT.push(item);
    }

};


$("#grid").append("<p>Fetching <u>HKUSPACE</u> data....</p>");
fetch("https://dry-sierra-94326.herokuapp.com/https://www1.hkuspace.hku.hk/cc/cht/admission/application-procedures/list-of-programmes-and-interview-arrangement-on-hku-space-cc-campuses", { cache: "no-store" }).then(function(response) {
    return response.text();
}).then(function(data) {

    var temp = document.implementation.createHTMLDocument('preview').createElement('div');
    temp.innerHTML = data;
    hkuspaceHandle(temp);

    $("#grid").append("<p>Fetching <u>HKBU</u> data....</p>");
    fetch("https://dry-sierra-94326.herokuapp.com/http://www.cie.hkbu.edu.hk/admissions/2017-18/available_programmes.php", { cache: "no-store" }).then(function(response) {
        return response.text();
    }).then(function(data) {
        var temp = document.implementation.createHTMLDocument('preview').createElement('div');
        temp.innerHTML = data;

        hkbuHandle(temp);

        var IVE = [{ "程度": "基礎文憑", "課程": "應用科學" }, { "程度": "基礎文憑", "課程": "設計" }, { "程度": "基礎文憑", "課程": "工程" }, { "程度": "基礎文憑", "課程": "酒店款接" }, { "程度": "基礎文憑", "課程": "社會服務" }, { "程度": "基礎文憑", "課程": "商業" }, { "程度": "基礎文憑", "課程": "零售" }, { "程度": "基礎文憑", "課程": "資訊科技" }, { "程度": "高級文憑", "課程": "環境科學高級文憑" }, { "程度": "高級文憑", "課程": "化驗科學高級文憑" }, { "程度": "高級文憑", "課程": "生物科技高級文憑" }, { "程度": "高級文憑", "課程": "化學科技高級文憑" }, { "程度": "高級文憑", "課程": "環境保護及環境管理高級文憑" }, { "程度": "高級文憑", "課程": "職業安全及風險管理高級文憑" }, { "程度": "高級文憑", "課程": "保育及樹木管理高級文憑" }, { "程度": "高級文憑", "課程": "藥劑科學高級文憑" }, { "程度": "高級文憑", "課程": "醫療保健高級文憑" }, { "程度": "高級文憑", "課程": "生物醫學高級文憑" }, { "程度": "高級文憑", "課程": "復康服務高級文憑" }, { "程度": "高級文憑", "課程": "應用營養學高級文憑" }, { "程度": "高級文憑", "課程": "長者社區保健護理高級文憑" }, { "程度": "高級文憑", "課程": "醫務中心營運高級文憑" }, { "程度": "高級文憑", "課程": "個人護理及美容產品學高級文憑" }, { "程度": "高級文憑", "課程": "食品科技及安全高級文憑" }, { "程度": "高級文憑", "課程": "視力保健護理高級文憑" }, { "程度": "高級文憑", "課程": "配藥學高級文憑" }, { "程度": "高級文憑", "課程": "產業管理高級文憑" }, { "程度": "高級文憑", "課程": "數碼營銷高級文憑" }, { "程度": "高級文憑", "課程": "會計學高級文憑" }, { "程度": "高級文憑", "課程": "工商管理學高級文憑" }, { "程度": "高級文憑", "課程": "航空及環球物流高級文憑" }, { "程度": "高級文憑", "課程": "航空與客運服務高級文憑" }, { "程度": "高級文憑", "課程": "企業行政管理學高級文憑" }, { "程度": "高級文憑", "課程": "法律及行政事務學高級文憑" }, { "程度": "高級文憑", "課程": "銀行及金融高級文憑" }, { "程度": "高級文憑", "課程": "人力資源管理學高級文憑" }, { "程度": "高級文憑", "課程": "公關及媒體事業高級文憑" }, { "程度": "高級文憑", "課程": "活動及推廣市場學高級文憑" }, { "程度": "高級文憑", "課程": "環球採購及供應管理高級文憑" }, { "程度": "高級文憑", "課程": "市場管理學高級文憑" }, { "程度": "高級文憑", "課程": "零售及採購管理高級文憑" }, { "程度": "高級文憑", "課程": "廣告及市場傳播高級文憑" }, { "程度": "高級文憑", "課程": "國際商業管理高級文憑" }, { "程度": "高級文憑", "課程": "幼兒教育高級文憑" }, { "程度": "高級文憑", "課程": "長者照顧服務高級文憑" }, { "程度": "高級文憑", "課程": "社會工作高級文憑" }, { "程度": "高級文憑", "課程": "特殊幼兒照顧及融合教育高級文憑" }, { "程度": "高級文憑", "課程": "產品、室內及展覽設計高級文憑（科目組）" }, { "程度": "高級文憑", "課程": "創意媒體高級文憑" }, { "程度": "高級文憑", "課程": "電影及電視高級文憑" }, { "程度": "高級文憑", "課程": "數碼音樂及媒體高級文憑" }, { "程度": "高級文憑", "課程": "視覺藝術與文化高級文憑" }, { "程度": "高級文憑", "課程": "視覺傳意高級文憑" }, { "程度": "高級文憑", "課程": "出版設計及印刷媒體高級文憑" }, { "程度": "高級文憑", "課程": "超媒體高級文憑" }, { "程度": "高級文憑", "課程": "時裝形象設計高級文憑" }, { "程度": "高級文憑", "課程": "時裝品牌策劃及採購高級文憑" }, { "程度": "高級文憑", "課程": "時裝媒體設計高級文憑" }, { "程度": "高級文憑", "課程": "演藝造型設計高級文憑" }, { "程度": "高級文憑", "課程": "時裝設計男裝高級文憑" }, { "程度": "高級文憑", "課程": "建築設計高級文憑" }, { "程度": "高級文憑", "課程": "園境建築高級文憑" }, { "程度": "高級文憑", "課程": "珠寶及形象產品設計高級文憑" }, { "程度": "高級文憑", "課程": "傢俱及時尚產品設計高級文憑" }, { "程度": "高級文憑", "課程": "舞台及佈景設計高級文憑" }, { "程度": "高級文憑", "課程": "珠寶設計及科技高級文憑" }, { "程度": "高級文憑", "課程": "視覺新聞高級文憑" }, { "程度": "高級文憑", "課程": "廣告設計高級文憑" }, { "程度": "高級文憑", "課程": "時裝設計高級文憑" }, { "程度": "高級文憑", "課程": "土木工程高級文憑" }, { "程度": "高級文憑", "課程": "建築學高級文憑" }, { "程度": "高級文憑", "課程": "測量學高級文憑" }, { "程度": "高級文憑", "課程": "建築科技及室內設計高級文憑" }, { "程度": "高級文憑", "課程": "建築設計及科技高級文憑" }, { "程度": "高級文憑", "課程": "環境工程高級文憑" }, { "程度": "高級文憑", "課程": "電子及通訊工程高級文憑" }, { "程度": "高級文憑", "課程": "電機工程高級文憑" }, { "程度": "高級文憑", "課程": "電腦工程高級文憑" }, { "程度": "高級文憑", "課程": "機械工程學高級文憑" }, { "程度": "高級文憑", "課程": "屋宇裝備工程學高級文憑" }, { "程度": "高級文憑", "課程": "飛機維修工程高級文憑" }, { "程度": "高級文憑", "課程": "汽車工程高級文憑" }, { "程度": "高級文憑", "課程": "海事科技高級文憑" }, { "程度": "高級文憑", "課程": "航空學高級文憑" }, { "程度": "高級文憑", "課程": "檢測及認證高級文憑" }, { "程度": "高級文憑", "課程": "眼鏡配鏡學高級文憑" }, { "程度": "高級文憑", "課程": "酒店及餐飲業管理高級文憑" }, { "程度": "高級文憑", "課程": "旅遊及會議展覽高級文憑" }, { "程度": "高級文憑", "課程": "康體文娛管理高級文憑" }, { "程度": "高級文憑", "課程": "運動行政學高級文憑" }, { "程度": "高級文憑", "課程": "運動教練學高級文憑" }, { "程度": "高級文憑", "課程": "機場營運管理高級文憑" }, { "程度": "高級文憑", "課程": "國際款待業管理（酒店、旅遊及康樂）高級文憑" }, { "程度": "高級文憑", "課程": "電訊及網絡科技高級文憑" }, { "程度": "高級文憑", "課程": "資訊及網絡安全高級文憑" }, { "程度": "高級文憑", "課程": "軟件工程高級文憑" }, { "程度": "高級文憑", "課程": "遊戲軟件開發高級文憑" }, { "程度": "高級文憑", "課程": "智能手機軟件開發高級文憑" }, { "程度": "高級文憑", "課程": "雲端系統及數據中心管理高級文憑" }, { "程度": "高級文憑", "課程": "數據科學及分析高級文憑" }, { "程度": "高級文憑", "課程": "多媒體創作高級文憑" }, { "程度": "高級文憑", "課程": "遊戲及動畫高級文憑" }, { "程度": "高級文憑", "課程": "舞台及娛樂科藝高級文憑" }, { "程度": "自資學士", "課程": "廣告(榮譽)文學士" }, { "程度": "自資學士", "課程": "時裝設計(榮譽)文學士" }, { "程度": "自資學士", "課程": "產品設計(榮譽)文學士" }, { "程度": "自資學士", "課程": "園境建築(榮譽)文學士" }, { "程度": "自資學士", "課程": "園藝及園境管理(榮譽)文學士" }, { "程度": "自資學士", "課程": "運動及康樂管理(榮譽)社會科學學士" }, { "程度": "自資學士", "課程": "專業會計(榮譽)文學士" }, { "程度": "自資學士", "課程": "酒店營運管理(榮譽)文學士" }, { "程度": "自資學士", "課程": "公共關係及管理(榮譽)文學士" }, { "程度": "自資學士", "課程": "廚藝及管理(榮譽)文學士" }, { "程度": "自資學士", "課程": "零售管理(榮譽)文學士" }, { "程度": "自資學士", "課程": "土木工程(榮譽)工學士" }, { "程度": "自資學士", "課程": "環境工程及管理(榮譽)工學士" }, { "程度": "自資學士", "課程": "屋宇設備工程(榮譽)工學士" }, { "程度": "自資學士", "課程": "醫療護理(榮譽)理學士" }, { "程度": "自資學士", "課程": "食品科學及安全(榮譽)理學士" }, { "程度": "自資學士", "課程": "創新及多媒體科技(榮譽)理學士" }, { "程度": "自資學士", "課程": "資訊及通訊科技(榮譽)理學士" }, { "程度": "自資學士", "課程": "測量學(榮譽)理學士" }];
        var IVE_campus = ["香港專業教育學院(柴灣)", "香港專業教育學院(摩理臣山)", "THEI(青衣)", "香港專業教育學院(黃克競)", "香港專業教育學院(葵涌)", "香港專業教育學院(觀塘)", "香港專業教育學院(沙田)", "香港專業教育學院(青衣)", "香港專業教育學院(屯門)", "香港專業教育學院(李惠利) 及 香港知專設計學院"];

        $("#grid").append("<p>Fetching <u>IVE</u> data....</p>");
        IVE.forEach(function(i) {


            for (var j = 0; j < IVE_campus.length; j++) {
                new kendoMODAL(i.程度,
                    IVE_campus[j],
                    i.課程,
                    "沒有提供"
                );
            }
        });

        var notGiven = [{ "程度": "副學士", "課程": "中英語文傳意副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商業傳意英語副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "語文及文化副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "公關傳訊副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "翻譯及傳譯副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "文科副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工程學副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "資訊科技副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "統計及數據科學副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "理科副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用社會科學副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用社會科學副學士(心理學)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用社會科學副學士(社會政策及行政)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用社會科學副學士(社會學及文化)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(會計)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(商業管理)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(金融)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(酒店管理)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(人力資源管理)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(國際商業)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(物流及供應鏈管理)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(市場學)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商業副學士(旅遊管理)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "設計學副學士(廣告設計)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "設計學副學士(環境及室內設計)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "設計學副學士(視覺傳意)", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "健康學副學士", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "社會工作高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "會展與項目管理高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "財務及投資策劃高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "服務管理高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "機械工程高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "飛機服務工程高級文憑", "院校": "香港理工大學香港專上學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "通識及文化研究文學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "音樂學文學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "人力資源管理學商學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "市場學商學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "新媒體及影視創意寫作文學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "綜合傳播管理學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "媒體及社會傳播社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "環境及資源管理社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "心理學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會政策社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "運動及康樂領袖學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院(九龍塘校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "通識及文化研究文學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "音樂學文學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "人力資源管理學商學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "市場學商學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "新媒體及影視創意寫作文學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "綜合傳播管理學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "媒體及社會傳播社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "環境及資源管理社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "心理學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會政策社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "運動及康樂領袖學社會科學學士(榮譽)學位", "院校": "香港浸會大學國際學院 (石門校園)", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工程學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "機場營運及航空物流", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商業分析", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "媒體創作", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "環保學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "資訊系統", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "網絡及系統管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "理學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "會計學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "金融服務", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "工商管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "環球物流及供應鏈管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人力資源管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "國際商務管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "市場學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用中文", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(英語及中文)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(日語及中文)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(日語及英語)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(法文及英語)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(韓語及英語)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(韓語及中文)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "雙語傳意(西班牙及英語)", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "傳意及公共關係", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "文化研究", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "數碼視覺設計", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "專業英語傳意", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "日語", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "翻譯及傳譯", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "社會科學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用心理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "應用社會科學（輔導與諮商／健康護理／國際關係／都市研究）", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "活動項目管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "法律學", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "康樂及旅遊管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "公共行政及管理", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "公共關係及廣告", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "社會工作", "院校": "香港城市大學專上學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商務學副學士", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "款待管理學高級文憑", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "專業文憑", "課程": "物業管理 (資歷架構第四級) [全日制/兼讀制]", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "基礎文憑", "課程": "物業管理 (資歷架構第三級) [全日制/兼讀制]", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "設計學高級文憑課程（時裝設計）", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "設計學高級文憑課程（平面設計）", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "設計學高級文憑課程（室內建築）", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "設計學高級文憑課程（互動媒體設計）", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "音樂研習高級文憑", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "基礎文憑", "課程": "綜合教育文憑(全日制/兼讀制)", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "配藥高級文憑課程", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "人本服務高級文憑", "院校": "明愛白英奇專業學校", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人文學科 (中國語言文學)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人文學科 (哲學)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人文學科 (歷史)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人文學科 (翻譯)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "人文學科 (文化研究與傳播)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商學 (工商管理)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商學 (市場學)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "商學 (金融服務)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "社會科學", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "社會科學 (心理學)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "副學士", "課程": "社會科學 (社會學)", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "中文媒體寫作及製作高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "日語及傳意高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "英語及傳意高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "專業會計學高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "工商管理高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "市場推廣及廣告學高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "運動教練及領袖學高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "體適能培訓及管理高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "財務策劃高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "創意媒體設計高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "幼兒教育高級文憑 ", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "心理學(諮商與輔導)高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "教育心理學高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "長者健康及護理高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "款待業(酒店實務) 高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "航空服務及管理高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "旅遊學高級文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "基礎文憑", "課程": "大專基礎教育文憑", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "日文及日本文化", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "翻譯初階", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "韓文及韓國潮流文化", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "市場學及工商管理", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "會計學", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "公務員文職", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "紀律部隊訓練", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "多媒體廣告設計", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "長者護理", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "幼兒教育", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "活用心理學", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "運動及體適能培訓", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "航空服務業", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "毅進文憑", "課程": "酒店服務", "院校": "嶺南大學持續進修學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "可持續發展教育榮譽文學士", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "通識教育榮譽文學士", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "音樂教育榮譽學士(當代音樂及演奏教育學)", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "科學教育榮譽學士(科學與網絡科技)", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "科學教育榮譽學士(運動科學)", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會科學教育榮譽學士 (大中華地區研究)", "院校": "香港教育大學 ", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "精算及保險(榮譽)理學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "應用及人本計算學(榮譽)文學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "亞洲研究(榮譽)社會科學學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "工商管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "文化及創意產業(榮譽)文學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "中文(榮譽)文學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "融合媒體及傳播科技(榮譽)文學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "企業管治工商管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "數據科學及商業智能學(榮譽)理學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "英國語文(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "金融分析工商管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "管理學工商管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "新聞及傳播(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "管理科學與資訊管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "供應鏈管理工商管理(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "商務翻譯(榮譽)學士", "院校": "恒生管理學院", "剩餘學額": "沒有提供" }, { "程度": "高級文憑", "課程": "藝術高級文憑", "院校": "香港藝術學院(香港藝術中心附屬機構)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "藝術文學士", "院校": "香港藝術學院(香港藝術中心附屬機構)", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "中國語言文學(榮譽)文學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "英國語言文學(榮譽)文學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "歷史學(榮譽)文學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "新聞與傳播(榮譽)文學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "工商管理學(榮譽)學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "會計學(榮譽)商學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "經濟及金融學(榮譽)文學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "法律與商業(榮譽)商學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "輔導及心理學(榮譽)社會科學學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "心理學(榮譽)社會科學學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會學(榮譽)社會科學學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會工作(榮譽)學士", "院校": "香港樹仁大學", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "文學士(榮譽)", "院校": "明德學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "社會科學(榮譽)學士", "院校": "明德學院", "剩餘學額": "沒有提供" }, { "程度": "自資學士", "課程": "專業會計(榮譽)學士", "院校": "明德學院", "剩餘學額": "沒有提供" }];

        notGiven.forEach(function(i) {
            new kendoMODAL(i.程度,
                i.院校,
                i.課程,
                "沒有提供"
            );
        });

        $("#grid").append("<p>Creating Table....</p>");
        gridBuild();
    });

});

var gridBuild = function() {

    $("#grid").html("").kendoGrid({
        dataSource: new kendo.data.DataSource({
            data: kendoDATA
        }),
        height: "100%",
        filterable: {
            mode: "row"
        },
        groupable: true,
        sortable: true,
        pageable: {
            refresh: true,
            pageSizes: true,
        },
        columns: [{
            field: "程度",
            title: "程度",
            filterable: {
                cell: {
                    showOperators: true,
                    operator: "contains"
                }
            }
        }, {
            field: "學校",
            title: "學校",
            filterable: {
                cell: {
                    showOperators: true,
                    operator: "contains"
                }
            }
        }, {
            field: "課程",
            title: "課程",
            filterable: {
                cell: {
                    showOperators: true,
                    operator: "contains"
                }
            }
        }, {
            field: "剩餘學額",
            title: "剩餘學額",
            width: 150,
            filterable: {
                cell: {
                    showOperators: true,
                    operator: "contains"
                }
            }
        }]
    });

};